import React, { useEffect } from "react";
import { Accordion } from "./Accordeon";
import Icons from "./icons";

var requestAccordeon = [{
    q: 'Створення замовлення',
    a: 'Після того, як ви знайдете бажаний товар, виберіть його розмір та натисніть кнопку «Додати до кошика». У вас є можливість продовжити покупки або ж негайно перейти до оформлення замовлення. Ми спростили процес замовлення, щоб зробити його для вас якнайзручнішим. Незалежно від кількості товарів, вам потрібно буде заповнити форму лише один раз. А важливий момент: коли ваша посилка буде готова до відправки, ви отримаєте SMS-повідомлення з номером декларації. Це дозволить вам відслідковувати ваше замовлення на всіх етапах доставки та бути в курсі процесу.'
}, {
    q: 'Доставка',
    a: 'Під час оформлення вашого замовлення, у вас є можливість вибрати один із наступних способів доставки: <br/> 1. **Самовивіз** - Ви зможете забрати ваше замовлення у зручний для вас час із нашого офісу, розташованого у місті Вінниця.<br/> 2. **Доставка через компанію "Нова Пошта"** - Ми пропонуємо доставку до відділення "Нова Пошта" по всій Україні. Зазвичай, час доставки становить 1-2 дні. Після відправлення вашого замовлення, ви отримаєте SMS-повідомлення з номером експрес-накладної, за допомогою якої ви завжди зможете перевірити статус вашого замовлення. Також у додатку "Нова Пошта" є можливість відслідковувати місцезнаходження вашого замовлення. Коли посилка дійде до відділення, ви отримаєте SMS-сповіщення. Будь ласка, отримайте своє замовлення протягом 5 робочих днів після прибуття, інакше воно автоматично повернеться до магазину.<br/> 3. **Кур\'єрська доставка через компанію "Нова Пошта"** - Ми також пропонуємо доставку прямо до вашої вказаної адреси. Перед прибуттям кур\'єр з "Нової Пошти" зв\'яжеться з вами для уточнення зручного часу доставки.'
}];

var exchangeAccordeon = [{
    q: 'Умови повернення та обміну',
    a: 'Ви маєте можливість повернути або обміняти придбаний товар впродовж 14 днів з моменту покупки. <br/>Ця можливість гарантується вам згідно із «Законом про захист прав споживачів». Для того, щоб скористатися цим правом, прохання впевнитися в наступному: <br/>1. Товар не був використаний та не має слідів експлуатації, таких як подряпини, сколи, потертості і т.п.<br/>2. Товар має повний комплект і не порушена цілісність його упаковки.<br/>3. Всі ярлики та заводське маркування збережені. <br/> Отже, ви маєте право обміняти товар відповідної якості, якщо він не відповідає вашим очікуванням за формою, розміром, фасоном, кольором або іншими параметрами, або ж якщо ви не можете використовувати його з інших причин. Обмін товару відповідної якості здійснюється лише у випадку, якщо він не був вжитим у використання та зберіг свій товарний вигляд, властивості, пломби та ярлики.'
}, {
    q: 'Як здійснити обмін чи повернення',
    a: 'Якщо товар відправлено з іншого міста, то ви зобов\'язані оплатити всі витрати, пов\'язані з процедурою повернення. Не приймаються посилки, для яких не сплачена доставка для повернення. Після повернення товару, повернення коштів відбувається протягом 5 банківських днів після того, як посилка прибула до магазину. В цей період проводиться огляд товару, передається інформація до бухгалтерії, і потім кошти повертаються на вашу карту або рахунок. Кожна посилка має страхування, і саме тому ми закликаємо отримувача уважно перевірити посилку на наявність пошкоджень або порушень цілісності. У разі виявлення будь-яких недоліків, будь ласка, негайно зателефонуйте нашому менеджеру, який готовий надати консультацію щодо подальших дій. Якщо ви оглядаєте посилку поза відділенням "Нова Пошта" (наприклад, отримуєте її від кур\'єра), ми готові надати оперативну підтримку та надіслати товар на заміну, в той час, коли ми вирішуємо питання з транспортною компанією. Це означає, що ви не понесете фінансових втрат і отримаєте заміну товару, який був пошкоджений під час транспортування.'
}];

var QA = function QA() {
    useEffect(function () {
        var hash = window.location.hash;
        console.log(hash, 'hash');
        if (hash) {
            var el = document.querySelector(hash);

            el.scrollIntoView({ behavior: "smooth" });
        }
    }, []);

    return React.createElement(
        "div",
        { className: "container" },
        React.createElement(
            "h1",
            { className: "text-center mb-30 uppercase margin-accordion" },
            "\u041F\u0438\u0442\u0430\u043D\u043D\u044F \u0442\u0430 \u0432\u0456\u0434\u043F\u043E\u0432\u0456\u0434\u0456"
        ),
        React.createElement(
            "div",
            { className: "margin-accordion", id: "delivery" },
            React.createElement(
                "h1",
                { className: "text-center accordion-heading" },
                "\u0417\u0430\u043C\u043E\u0432\u043B\u0435\u043D\u043D\u044F \u0456 \u0434\u043E\u0441\u0442\u0430\u0432\u043A\u0430"
            ),
            React.createElement(Accordion, { faqList: requestAccordeon })
        ),
        React.createElement(
            "div",
            { className: "margin-accordion", id: "exchange" },
            React.createElement(
                "h1",
                { className: "text-center accordion-heading" },
                "\u041F\u043E\u0432\u0435\u0440\u043D\u0435\u043D\u043D\u044F \u0442\u0430 \u043E\u0431\u043C\u0456\u043D"
            ),
            React.createElement(Accordion, { faqList: exchangeAccordeon })
        ),
        React.createElement(
            "div",
            { className: "margin-accordion", id: "about" },
            React.createElement(
                "h1",
                { className: "text-center accordion-heading" },
                "\u041F\u0440\u043E \u043D\u0430\u0441"
            ),
            React.createElement(
                "div",
                null,
                "\u0411\u0440\u0435\u043D\u0434\u043E\u0432\u0438\u0439 \u043E\u0434\u044F\u0433: \u041C\u0438 \u043F\u0440\u043E\u043F\u043E\u043D\u0443\u0454\u043C\u043E \u0432\u0435\u043B\u0438\u043A\u0438\u0439 \u0432\u0438\u0431\u0456\u0440 \u0431\u0440\u0435\u043D\u0434\u043E\u0432\u043E\u0433\u043E \u043E\u0434\u044F\u0433\u0443 \u0434\u043B\u044F \u0447\u043E\u043B\u043E\u0432\u0456\u043A\u0456\u0432 \u0456 \u0436\u0456\u043D\u043E\u043A \u0432 \u0440\u0456\u0437\u043D\u0438\u0445 \u0441\u0442\u0438\u043B\u044F\u0445 \u0442\u0430 \u043D\u0430\u043F\u0440\u044F\u043C\u043A\u0430\u0445 \u043C\u043E\u0434\u0438.",
                React.createElement(
                    "p",
                    null,
                    "\u0414\u043E\u0441\u0442\u0443\u043F\u043D\u0456\u0441\u0442\u044C: \u041D\u0435\u0437\u0432\u0430\u0436\u0430\u044E\u0447\u0438 \u043D\u0430 \u0431\u0440\u0435\u043D\u0434\u043E\u0432\u0438\u0439 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440, \u043D\u0430\u0448 \u043E\u0434\u044F\u0433 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0438\u0439 \u0437\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0438\u043C\u0438 \u0446\u0456\u043D\u0430\u043C\u0438, \u0449\u043E\u0431 \u043A\u043E\u0436\u0435\u043D \u043C\u0456\u0433 \u0434\u043E\u0437\u0432\u043E\u043B\u0438\u0442\u0438 \u0441\u043E\u0431\u0456 \u044F\u043A\u0456\u0441\u043D\u0438\u0439 \u043E\u0434\u044F\u0433."
                ),
                React.createElement(
                    "p",
                    null,
                    "\u042F\u043A\u0456\u0441\u0442\u044C: \u041C\u0438 \u0440\u0435\u0442\u0435\u043B\u044C\u043D\u043E \u043E\u0431\u0438\u0440\u0430\u0454\u043C\u043E \u0442\u043E\u0432\u0430\u0440\u0438, \u0449\u043E\u0431 \u0433\u0430\u0440\u0430\u043D\u0442\u0443\u0432\u0430\u0442\u0438 \u0457\u0445 \u0432\u0438\u0441\u043E\u043A\u0443 \u044F\u043A\u0456\u0441\u0442\u044C \u0442\u0430 \u0434\u043E\u0432\u0433\u043E\u0432\u0456\u0447\u043D\u0456\u0441\u0442\u044C."
                ),
                React.createElement(
                    "p",
                    null,
                    "\u0420\u0456\u0437\u043D\u043E\u043C\u0430\u043D\u0456\u0442\u043D\u0456\u0441\u0442\u044C \u0441\u0442\u0438\u043B\u0456\u0432: \u0412 \u043D\u0430\u0448\u043E\u043C\u0443 \u0430\u0441\u043E\u0440\u0442\u0438\u043C\u0435\u043D\u0442\u0456 \u0454 \u043E\u0434\u044F\u0433 \u0440\u0456\u0437\u043D\u0438\u0445 \u0441\u0442\u0438\u043B\u0456\u0432 \u0442\u0430 \u043D\u0430\u043F\u0440\u044F\u043C\u043A\u0456\u0432, \u0432\u0456\u0434 \u043A\u043B\u0430\u0441\u0438\u0447\u043D\u043E\u0433\u043E \u0434\u043E \u043A\u0435\u0436\u0443\u0430\u043B \u0456 \u0441\u043F\u043E\u0440\u0442\u0438\u0432\u043D\u043E\u0433\u043E."
                ),
                React.createElement(
                    "p",
                    null,
                    "\u0417\u0440\u0443\u0447\u043D\u0456\u0441\u0442\u044C \u043F\u043E\u043A\u0443\u043F\u043E\u043A: \u041C\u0438 \u043F\u0440\u043E\u043F\u043E\u043D\u0443\u0454\u043C\u043E \u0437\u0440\u0443\u0447\u043D\u0443 \u043E\u043D\u043B\u0430\u0439\u043D-\u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u0443 \u0434\u043B\u044F \u0448\u0432\u0438\u0434\u043A\u0438\u0445 \u0442\u0430 \u0431\u0435\u0437\u043F\u0435\u0447\u043D\u0438\u0445 \u043F\u043E\u043A\u0443\u043F\u043E\u043A."
                ),
                React.createElement(
                    "p",
                    null,
                    "\u0412\u0438\u0441\u043E\u043A\u0430 \u044F\u043A\u0456\u0441\u0442\u044C \u043E\u0431\u0441\u043B\u0443\u0433\u043E\u0432\u0443\u0432\u0430\u043D\u043D\u044F: \u041D\u0430\u0448\u0430 \u043A\u043E\u043C\u0430\u043D\u0434\u0430 \u0437\u0430\u0432\u0436\u0434\u0438 \u0433\u043E\u0442\u043E\u0432\u0430 \u043D\u0430\u0434\u0430\u0442\u0438 \u0432\u0430\u043C \u0456\u043D\u0434\u0438\u0432\u0456\u0434\u0443\u0430\u043B\u044C\u043D\u0443 \u043F\u0456\u0434\u0442\u0440\u0438\u043C\u043A\u0443 \u0442\u0430 \u043A\u043E\u043D\u0441\u0443\u043B\u044C\u0442\u0430\u0446\u0456\u0457."
                ),
                React.createElement(
                    "p",
                    null,
                    "\u0414\u043E\u0441\u0442\u0430\u0432\u043A\u0430: \u041C\u0438 \u0437\u0430\u0431\u0435\u0437\u043F\u0435\u0447\u0443\u0454\u043C\u043E \u0448\u0432\u0438\u0434\u043A\u0443 \u0442\u0430 \u043D\u0430\u0434\u0456\u0439\u043D\u0443 \u0434\u043E\u0441\u0442\u0430\u0432\u043A\u0443 \u0432\u0430\u0448\u043E\u0433\u043E \u0437\u0430\u043C\u043E\u0432\u043B\u0435\u043D\u043D\u044F, \u0449\u043E\u0431 \u0432\u0438 \u043C\u043E\u0433\u043B\u0438 \u043E\u0442\u0440\u0438\u043C\u0430\u0442\u0438 \u0441\u0432\u0456\u0439 \u043E\u0434\u044F\u0433 \u0432\u0447\u0430\u0441\u043D\u043E."
                ),
                React.createElement(
                    "p",
                    null,
                    "\u0421\u0442\u0438\u043B\u044C \u0442\u0430 \u044F\u043A\u0456\u0441\u0442\u044C \u0437\u0430\u0440\u0430\u0437 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0456 \u0434\u043B\u044F \u0432\u0441\u0456\u0445 - \u0446\u0435 \u0433\u0430\u0441\u043B\u043E \u0432\u0430\u0448\u043E\u0433\u043E \u043C\u0430\u0433\u0430\u0437\u0438\u043D\u0443, \u044F\u043A\u0435 \u043F\u0456\u0434\u043A\u0440\u0435\u0441\u043B\u044E\u0454 \u0432\u0430\u0448\u0443 \u043C\u0456\u0441\u0456\u044E - \u0440\u043E\u0431\u0438\u0442\u0438 \u0431\u0440\u0435\u043D\u0434\u043E\u0432\u0438\u0439 \u043E\u0434\u044F\u0433 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0438\u043C \u0434\u043B\u044F \u0432\u0441\u0456\u0445, \u043D\u0435 \u043A\u043E\u043C\u043F\u0440\u043E\u043C\u0456\u0442\u0443\u044E\u0447\u0438 \u044F\u043A\u0456\u0441\u0442\u044C."
                )
            )
        ),
        React.createElement(
            "div",
            { id: "contact-us" },
            React.createElement(
                "h1",
                { className: "text-center accordion-heading" },
                "\u0417\u0432'\u044F\u0436\u0456\u0442\u044C\u0441\u044F \u0437 \u043D\u0430\u043C\u0438"
            ),
            React.createElement(
                "div",
                { className: "body1" },
                React.createElement(
                    "div",
                    { className: "uppercase bold-label flex-row align-center" },
                    React.createElement(
                        "div",
                        { className: "standart-icon" },
                        React.createElement(Icons, { icon: 'phone' })
                    ),
                    React.createElement(
                        "div",
                        { className: "ml-5" },
                        "\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u0438:"
                    )
                ),
                React.createElement(
                    "p",
                    { className: "body1" },
                    React.createElement(
                        "span",
                        { className: "bold-label" },
                        "\u041F\u041D-\u041F\u0422:"
                    ),
                    " 10:00 \u2013 19:00"
                ),
                React.createElement(
                    "p",
                    { className: "body1" },
                    React.createElement(
                        "span",
                        { className: " bold-label" },
                        "\u0421\u0411-\u041D\u0414:"
                    ),
                    " 10:00 - 17:00"
                ),
                React.createElement(
                    "div",
                    { className: "flex-row align-center mb-10" },
                    React.createElement(
                        "div",
                        { className: "standart-icon" },
                        React.createElement(Icons, { icon: 'telegram' })
                    ),
                    React.createElement(
                        "div",
                        { className: "ml-5 bold-label" },
                        "@Maxm_Kos"
                    )
                ),
                React.createElement(
                    "div",
                    { className: "flex-row align-center" },
                    React.createElement(
                        "div",
                        { className: "standart-icon" },
                        React.createElement(Icons, { icon: 'viber' })
                    ),
                    React.createElement(
                        "div",
                        { className: "ml-5 bold-label" },
                        "0669201260"
                    )
                )
            )
        )
    );
};

export default QA;